In [2]:
%load_ext sql

In [3]:
%sql postgresql://postgres:@Jgun220@127.0.0.1/jagan_insurello_etl

In [27]:
%%sql select C.country,V.people_vaccinated, C.population, round(cast(V.people_vaccinated as numeric) / C.population * 100, 2) as coverage
from country_info C
join vaccined_info V
on C.country_id = V.country_id
order by coverage desc
limit 5
offset 7

 * postgresql://postgres:***@127.0.0.1/jagan_insurello_etl
5 rows affected.

[('Seychelles', 65873, Decimal('94737.0'), Decimal('69.53')),
 ('San Marino', 21580, Decimal('33400.0'), Decimal('64.61')),
 ('Israel', 5139005, Decimal('8321570.0'), Decimal('61.76')),
 ('Bahrain', 839685, Decimal('1492584.0'), Decimal('56.26')),
 ('Malta', 238807, Decimal('430835.0'), Decimal('55.43'))]

In [4]:
%sql SELECT * FROM vaccined_info limit 5;

 * postgresql://postgres:***@127.0.0.1/jagan_insurello_etl
5 rows affected.

[(0, 0, 641295, 158343, 482952, datetime.datetime(2021, 6, 10, 0, 0)),
 (1, 1, 803682, 310336, 493346, datetime.datetime(2021, 6, 10, 0, 0)),
 (2, 2, 2500000, 0, 2500000, datetime.datetime(2021, 6, 10, 0, 0)),
 (3, 3, 35926, 8303, 27613, datetime.datetime(2021, 6, 10, 0, 0)),
 (4, 4, 1115919, 375630, 740289, datetime.datetime(2021, 6, 10, 0, 0))]

In [5]:
%sql SELECT * FROM confirmed_cases limit 10;

 * postgresql://postgres:***@127.0.0.1/jagan_insurello_etl
10 rows affected.

[(0, 0, datetime.date(2021, 6, 9), 84050),
 (1, 0, datetime.date(2021, 6, 8), 82326),
 (2, 0, datetime.date(2021, 6, 7), 80841),
 (3, 0, datetime.date(2021, 6, 6), 79224),
 (4, 0, datetime.date(2021, 6, 5), 77963),
 (5, 0, datetime.date(2021, 6, 4), 76628),
 (6, 0, datetime.date(2021, 6, 3), 75119),
 (7, 0, datetime.date(2021, 6, 2), 74026),
 (8, 0, datetime.date(2021, 6, 1), 72977),
 (9, 0, datetime.date(2021, 5, 31), 71838)]

In [6]:
%sql SELECT count(*) FROM country_info;

 * postgresql://postgres:***@127.0.0.1/jagan_insurello_etl
1 rows affected.

[(194,)]

In [7]:
%sql SELECT count(*) FROM vaccined_info;

 * postgresql://postgres:***@127.0.0.1/jagan_insurello_etl
1 rows affected.

[(165,)]

In [8]:
%sql SELECT count(*) FROM confirmed_cases;

 * postgresql://postgres:***@127.0.0.1/jagan_insurello_etl
1 rows affected.

[(97970,)]